'''
Scripts for Arknights
'''
from itertools import chain, combinations

def powerset(iterable):
    '''powerset([1,2,3]) --> () (1,) (2,) (3,) (1,2) (1,3) (2,3) (1,2,3)'''
    s = list(iterable)
    return chain.from_iterable(combinations(s, r) for r in range(len(s)+1))

def recruit(slice) -> str:
    pos = {'초기': {'야토우': 2, '두린': 2, '12F': 2, '레인저': 2, '느와르혼': 2},\
            '엘리트': {'텍사스': 5, '지마': 5, '프틸롭시스': 5, '사일런스': 5, '와파린': 5,\
            '레드': 5, '만티코어': 5, '클리프하트': 5, '에프이터': 5, '프로방스': 5, '아즈리우스': 5,\
            '파이어워치': 5, '메테오리테': 5, '플라티나': 5, '프라마닉스': 5, '이스티나': 5, '메이어': 5,\
            '스펙터': 5, '인드라': 5, '니어': 5, '리스캄': 5, '벌칸': 5, '크로와상': 5},\
            '상급엘리트': {'시즈': 6, '샤이닝': 6, '나이팅게일': 6, '이프리트': 6, '엑시아': 6, '실버애쉬': 6,\
            '호시구마': 6, '사리아': 6}, '근거리': {'텍사스': 5, '지마': 5, '레드': 5, '만티코어': 5, '클리프하트': 5,\
            '에프이터': 5, '스펙터': 5, '인드라': 5, '니어': 5, '리스캄': 5, '벌칸': 5, '크로와상': 5, '스캐빈저': 4,\
            '비그나': 4, '그라벨': 4, '로프': 4, '쇼우': 4, '도베르만': 4, '에스텔': 4, '무스': 4, '프로스트리프': 4,\
            '마토이마루': 4, '굼': 4, '매터호른': 4, '펭': 3, '바닐라': 3, '플룸': 3, '멜란사': 3, '비글': 3, '야토우': 2,\
            '느와르혼': 2, '캐슬-3': 1}, '원거리': {'프틸롭시스': 5, '사일런스': 5, '와파린': 5, '프로방스': 5, '아즈리우스': 5,\
            '파이어워치': 5, '메테오리테': 5, '플라티나': 5, '프라마닉스': 5, '이스티나': 5, '메이어': 5, '밀라': 4, '퍼퓨머': 4,\
            '헤이즈': 4, '기타노': 4, '시라유키': 4, '메테오': 4, '제시카': 4, '어스스피릿': 4, '하이비스커스': 3, '안셀': 3,\
            '라바': 3, '스튜어드': 3, '크루스': 3, '아드나키엘': 3, '오키드': 3, '두린': 2, '12F': 2, '레인저': 2, '랜싯-2': 1},\
            '전위': {'스펙터': 5, '인드라': 5, '도베르만': 4, '에스텔': 4, '무스': 4, '프로스트리프': 4, '마토이마루': 4, '멜란사': 3,\
            '캐슬-3': 1}, '의료': {'프틸롭시스': 5, '사일런스': 5, '와파린': 5, '밀라': 4, '퍼퓨머': 4, '하이비스커스': 3, '안셀': 3,\
            '랜싯-2': 1}, '선봉': {'텍사스': 5, '지마': 5, '스캐빈저': 4, '비그나': 4, '펭': 4, '바닐라': 4, '플룸': 3, '야토우': 2},\
            '술사': {'헤이즈': 4, '기타노': 4, '라바': 3, '스튜어드': 3, '두린': 2, '12F': 2}, '저격': {'프로방스': 5, '아즈리우스': 5,\
            '파이어워치': 5, '메테오리테': 5, '플라티나': 5, '시라유키': 4, '메테오': 4, '제시카': 4, '크루스': 3, '아드나키엘': 3,\
            '레인저': 2}, '중장': {'니어': 5, '리스캄': 5, '벌칸': 5, '크로와상': 5, '쿠오라': 4, '굼': 4, '매터호른': 4, '비글': 3,\
            '느와르혼': 2}, '보조': {'프라마닉스': 5, '이스티나': 5, '메이어': 5, '어스스피릿': 4, '오키드': 3}, '특수': {'레드': 5,\
            '만티코어': 5, '클리프하트': 5, '에프이터': 5, '그라벨': 4, '로프': 4, '쇼우': 4}, '치유': {'프틸롭시스': 5, '사일런스': 5,\
            '와파린': 5, '니어': 5, '밀라': 4, '퍼퓨머': 4, '굼': 4, '하이비스커스': 3, '안셀': 3, '랜싯-2': 1}, '지원': {'지마': 5,\
            '프틸롭시스': 5, '와파린': 5, '도베르만': 4, '캐슬-3': 1}, '화력': {'만티코어': 5, '클리프하트': 5, '프로방스': 5,\
            '아즈리우스': 5, '파이어워치': 5, '플라티나': 5, '이스티나': 5, '인드라': 5, '리스캄': 5, '벌칸': 5, '스캐빈저': 4,\
            '비그나': 4, '헤이즈': 4, '메테오': 4, '제시카': 4, '도베르만': 4, '무스': 4, '프로스트리프': 4, '마토이마루': 4,\
            '플룸': 3, '스튜어드': 3, '크루스': 3, '아드나키엘': 3, '멜란사': 3}, '범위공격': {'메테오리테': 5, '스펙터': 5, '기타노': 4,\
            '시라유키': 4, '에스텔': 4, '라바': 3}, '감속': {'에프이터': 5, '이스티나': 5, '시라유키': 4, '어스스피릿': 4, '프로스트리프': 4,\
            '오키드': 3}, '생존': {'만티코어': 5, '스펙터': 5, '인드라': 5, '벌칸': 5, '제시카': 4, '에스텔': 4, '마토이마루': 4, '멜란사': 3},\
            '방어': {'니어': 5, '리스캄': 5, '벌칸': 5, '크로와상': 5, '그라벨': 4, '쿠오라': 4, '굼': 4, '매터호른': 4, '비글': 3},\
            '약화': {'메테오리테': 5, '프라마닉스': 5, '헤이즈': 4, '메테오':4}, '강제이동': {'클리프하트': 5, '에프이터': 5,\
            '크로와상': 5, '로프': 5, '쇼우': 5}, '통제': {'텍사스': 5, '레드': 5, '메이어': 5}, '폭발력': {'파이어워치': 5},\
            '소환': {'메이어': 5}, '고속재배치': {'레드': 5, '그라벨': 4}, '코스트회복': {'텍사스': 5, '지마': 5, '스캐빈저': 4,\
            '비그나': 4, '펭': 3, '바닐라': 3, '플룸': 3}, '로봇': {'랜싯-2': 1, '캐슬-3': 1}}

    check = all(arg in pos for arg in slice)
    if not check: return "FALSE"

    res, temp = {}, set()
    if len(slice) > 3: cands = list(combinations(slice,3))
    else: cands = list(combinations(slice, len(slice)))

    for i in cands:
        for j in powerset(i):
            if j and j not in res:
                temp.add(j)


    cands = sorted(list(temp), key = len)
    for i in cands[::-1]:
        intersect = set.intersection(*map(lambda x: set(pos[x]), i))
        if len(intersect) != 0: res['+'.join(i)] =  intersect

    return res

str = ['생존', '중장']
str2 = ['생존', '중장', '코스트회복', '근거리', '보조']
print(all(i in pos for i in str))
print(recruit(str))
for k, v in recruit(str2).items():
    print(k, ' '.join(v))

'''
a = set(pos['초기'])
b = set(pos['근거리'])
c = set(pos['엘리트'])
d = set(pos['생존'])
e = set(pos['중장'])
x = [b,c]
y = [d,e]
print(set.intersection(*x))
print(set.intersection(*y))
'''
